giovannimasi/MATLAB_Simulink_tirocinio_2025/Examples/R2024b/mcb/HallOffsetExample/mcb_pmsm_hall_offset_f28069m_drv8305_ert_rtw/mcb_pmsm_hall_offset_f28069m_drv8305.h
 * '<S155>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 5'
 * '<S156>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 6'
 * '<S157>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/+ve Direction/Hall Value of 7'
 * '<S158>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 1'
 * '<S159>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 2'
 * '<S160>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 3'
 * '<S161>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 4'
 * '<S162>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 5'
 * '<S163>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 6'
 * '<S164>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Offset Calculation/Subsystem/Calculate Position from Hall/Hall Speed and Position/Speed and direction are valid Use speed to extrapolate position/Subsystem1/-ve Direction/Hall Value of 7'
 * '<S165>' : 'mcb_pmsm_hall_offset_f28069m_drv8305/Serial Receive/Data_Conditioning'
 */
#endif                             /* mcb_pmsm_hall_offset_f28069m_drv8305_h_ */

/*
 * File trailer for generated code.
 *
 * [EOF]
 */
